profiling/artillery_conConsole.log.txt
Phase started: unnamed (index: 0, duration: 1s) 18:23:44(-0300)

Phase completed: unnamed (index: 0, duration: 1s) 18:23:45(-0300)

--------------------------------------
Metrics for period to: 18:23:50(-0300) (width: 5.11s)
--------------------------------------

http.codes.200: ................................................................ 2078
http.request_rate: ............................................................. 416/sec
http.requests: ................................................................. 2121
http.response_time:
  min: ......................................................................... 2
  max: ......................................................................... 175
  median: ...................................................................... 113.3
  p95: ......................................................................... 147
  p99: ......................................................................... 165.7
http.responses: ................................................................ 2078
vusers.completed: .............................................................. 7
vusers.created: ................................................................ 50
vusers.created_by_name.0: ...................................................... 50
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 3712.4
  max: ......................................................................... 4948.6
  median: ...................................................................... 4492.8
  p95: ......................................................................... 4770.6
  p99: ......................................................................... 4770.6


--------------------------------------
Metrics for period to: 18:24:00(-0300) (width: 0.937s)
--------------------------------------

http.codes.200: ................................................................ 422
http.request_rate: ............................................................. 379/sec
http.requests: ................................................................. 379
http.response_time:
  min: ......................................................................... 15
  max: ......................................................................... 120
  median: ...................................................................... 74.4
  p95: ......................................................................... 108.9
  p99: ......................................................................... 115.6
http.responses: ................................................................ 422
vusers.completed: .............................................................. 43
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 5003.3
  max: ......................................................................... 5377.1
  median: ...................................................................... 5272.4
  p95: ......................................................................... 5378.9
  p99: ......................................................................... 5378.9


All VUs finished. Total time: 7 seconds

--------------------------------
Summary report @ 18:23:52(-0300)
--------------------------------

http.codes.200: ................................................................ 2500
http.request_rate: ............................................................. 398/sec
http.requests: ................................................................. 2500
http.response_time:
  min: ......................................................................... 2
  max: ......................................................................... 175
  median: ...................................................................... 104.6
  p95: ......................................................................... 147
  p99: ......................................................................... 165.7
http.responses: ................................................................ 2500
vusers.completed: .............................................................. 50
vusers.created: ................................................................ 50
vusers.created_by_name.0: ...................................................... 50
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 3712.4
  max: ......................................................................... 5377.1
  median: ...................................................................... 5272.4
  p95: ......................................................................... 5378.9
  p99: ......................................................................... 5378.9