profiling/artillery_sinConsole.log.txt
Phase started: unnamed (index: 0, duration: 1s) 18:19:56(-0300)

Phase completed: unnamed (index: 0, duration: 1s) 18:19:57(-0300)

--------------------------------------
Metrics for period to: 18:20:00(-0300) (width: 2.618s)
--------------------------------------

http.codes.200: ................................................................ 2500
http.request_rate: ............................................................. 959/sec
http.requests: ................................................................. 2500
http.response_time:
  min: ......................................................................... 1
  max: ......................................................................... 86
  median: ...................................................................... 36.2
  p95: ......................................................................... 58.6
  p99: ......................................................................... 79.1
http.responses: ................................................................ 2500
vusers.completed: .............................................................. 50
vusers.created: ................................................................ 50
vusers.created_by_name.0: ...................................................... 50
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 863.7
  max: ......................................................................... 2014.6
  median: ...................................................................... 1863.5
  p95: ......................................................................... 1978.7
  p99: ......................................................................... 2018.7


All VUs finished. Total time: 3 seconds

--------------------------------
Summary report @ 18:20:00(-0300)
--------------------------------

http.codes.200: ................................................................ 2500
http.request_rate: ............................................................. 959/sec
http.requests: ................................................................. 2500
http.response_time:
  min: ......................................................................... 1
  max: ......................................................................... 86
  median: ...................................................................... 36.2
  p95: ......................................................................... 58.6
  p99: ......................................................................... 79.1
http.responses: ................................................................ 2500
vusers.completed: .............................................................. 50
vusers.created: ................................................................ 50
vusers.created_by_name.0: ...................................................... 50
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 863.7
  max: ......................................................................... 2014.6
  median: ...................................................................... 1863.5
  p95: ......................................................................... 1978.7
  p99: ......................................................................... 2018.7